In [1]:
import pandas as pd
import numpy
import datetime
import random
import json

In [2]:
BOH_ITEM_COUNT = 1000
RECIPES_COUNT = 50
RECIEPTS_COUNT = 10000
RECIEPT_ITEM_COUNT = 20
SERVERS_COUNT = 200

In [3]:
boh_items_df = pd.DataFrame({
    'id': [x+1 for x in range(BOH_ITEM_COUNT)],
    'name': [f'item_name_{x+1}' for x in range(BOH_ITEM_COUNT)],
    'price_per_unit': [round(random.uniform(0,10), 2) for x in range(BOH_ITEM_COUNT)]
})
boh_items_df.head()

   id         name  price_per_unit
0   1  item_name_1            5.10
1   2  item_name_2            6.62
2   3  item_name_3            3.55
3   4  item_name_4            3.88
4   5  item_name_5            5.38

In [4]:
def recipe_total_price(recipe):
    total = 0
    for x in recipe:
        total += boh_items_df[boh_items_df['id'] == int(x)]['price_per_unit'].tolist()[0]
    return total


recipes_df = pd.DataFrame({
    'id': [x+1 for x in range(RECIPES_COUNT)],
    'recipe_name': [f'recipe_{x+1}' for x in range(RECIPES_COUNT)],
    'recipe': [str([random.randint(1,RECIPES_COUNT) for x in range(random.randint(2,RECIPES_COUNT))])[1:-1] for x in range(RECIPES_COUNT)]
})

recipes_df['price_to_create_dish'] = [recipe_total_price(recipes_df['recipe'].tolist()[x].split(',')) for x in range(RECIPES_COUNT)]

recipes_df.head()

,id,recipe_name,recipe,price_to_create_dish
0,1,recipe_1,"37, 31, 48, 28, 48, 23, 8, 10, 26, 43, 31, 31,...",128.33
1,2,recipe_2,"1, 21, 23, 33, 28, 27, 21, 42, 17, 35, 12, 35,...",70.55
2,3,recipe_3,"9, 11, 15, 2, 3, 50, 30, 6, 29, 21, 3, 50, 24,...",123.78
3,4,recipe_4,"9, 3, 47, 3, 43, 40, 3, 39, 31, 10, 50, 4, 28,...",186.28
4,5,recipe_5,"8, 38, 10, 42, 45, 36, 8, 42, 38, 42, 18, 30, ...",155.05

In [5]:
def gross_sum(items: list):
    total = 0
    for x in items:
        total += recipes_df[recipes_df['id'] == int(x)]['price_to_create_dish'].tolist()[0] * 3
    return total


reciepts_df = pd.DataFrame({
    'id': [x+1 for x in range(RECIEPTS_COUNT)],
    'items': [str([recipes_df['id'].tolist()[random.randint(0,len(recipes_df)-1)] for y in range(random.randint(1,RECIEPT_ITEM_COUNT))])[1:-1] for x in range(RECIEPTS_COUNT)],
    'server_id': [random.randint(0,SERVERS_COUNT) for x in range(RECIEPTS_COUNT)],
})

reciepts_df['gross'] = [gross_sum(reciepts_df['items'].tolist()[x].split(',')) for x in range(RECIEPTS_COUNT)]
reciepts_df['tax'] = reciepts_df['gross'] * 0.0875
reciepts_df['total'] = reciepts_df['tax'] + reciepts_df['gross']
"""
'tax': [],
'total': [],
'time': [],
"""

reciepts_df.head()

,id,items,server_id,gross,tax,total
0,1,"40, 41, 17, 24, 16, 12, 1, 13, 23, 28, 49, 42,...",170,6836.43,598.187625,7434.617625
1,2,"43, 1, 7, 47, 12, 37, 18, 36, 34, 5, 46",177,5670.24,496.146000,6166.386000
2,3,"25, 18, 42, 35, 46, 24, 27, 8, 24, 48, 44, 29,...",174,7993.77,699.454875,8693.224875
3,4,"1, 5, 26, 23, 20, 25, 40, 6, 46, 29, 13, 40, 35",152,5496.18,480.915750,5977.095750
4,5,"14, 45, 2, 5, 9, 40, 31, 1, 18, 10, 25, 22, 44",131,4914.72,430.038000,5344.758000

In [6]:
def random_date():
    return numpy.datetime64('2005-01-01') - random.randint(1, 65*365)


def random_hire_date():
    return numpy.datetime64('2023-01-01') - random.randint(1, 10*365)

def random_sex():
    return random.randint(1,3)
server_df = pd.DataFrame({
    'id': [x+1 for x in range(SERVERS_COUNT)],
    'name': [f'server_name_{x+1}' for x in range(SERVERS_COUNT)],
    'sex': [random_sex() for x in range(SERVERS_COUNT)]
})
server_df['born'] = [random_date() for x in range(SERVERS_COUNT)]
server_df['hire_date'] = [random_hire_date() for x in server_df['born'].tolist()]

server_df.head()

   id           name  sex       born  hire_date
0   1  server_name_1    3 1948-07-14 2015-05-25
1   2  server_name_2    2 1947-08-13 2019-07-03
2   3  server_name_3    2 1961-07-30 2016-07-17
3   4  server_name_4    2 1995-08-24 2019-11-25
4   5  server_name_5    2 2000-07-23 2021-07-28

In [7]:
import os
if 'resources' not in os.listdir():
    os.mkdir('resources')
boh_items_df.to_csv('resources/boh_items.csv', index=False)
recipes_df.to_csv('resources/recipes.csv', index=False)
reciepts_df.to_csv('resources/reciepts.csv', index=False)
server_df.to_csv('resources/servers.csv', index=False)